{
    "url": "https://www.migeprof.gov.rw/about",
    "headings": [],
    "paragraphs": [
        "MIGEPROF",
        "About the Ministry",
        "The Ministry of Gender and Family Promotion (MIGEPROF) is the Central Government institution mandated to ensure strategic coordination of the implementation of national policies, strategies and programs regarding the promotion of the family, gender and children’s rights’ protection to facilitate their integration in the socio-economic and political context of Rwanda.",
        "Phone:9059 (Toll free)",
        "Email:info@migeprof.gov.rw",
        "Address:A &P Building Second Floor",
        "Google map address:21 KG 7 Ave, Kigali",
        "The Ministry of Gender and Family Promotion (MIGEPROF) is the Central Government institution mandated to ensure strategic coordination of policy implementation in the areas of gender and family promotion, women's empowerment and child rights protection. It plays a leading role in the implementation of gender agenda.",
        "In order to achieve its mandate, the Ministry of Gender and Family Promotion works with its affiliated agencies, different partners including Government Institutions, Development partners, NGOs, Faith Based Organizations, Civil Society and the Private Sector.",
        "MOTTO",
        "Stable Family, Gender equality and complementarity.",
        "VISION",
        "Creating a conducive environment for the family stability, gender equality and child protection towards sustainable development.",
        "MISSION",
        "HISTORICAL BACKGROUND",
        "The Ministry in charge of Family and Women Promotion MIFAPROFE was set up from 1992. Since 1994, The Government of Rwanda has demonstrated strong commitment to promote gender equality and women’s empowerment. This commitment has been reflected among other things in the setting up of the necessary institutional machinery to manage gender programs in the country. The nature and focus of the Ministry responsible for gender, family and children has evolved over time to reflect the existing challenges and priorities in the Rwandan Society.",
        "Ministry in charge of Family and Women’s Promotion (MIFAPROFE) to address the enormous challenges created by the consequences of the 1994 Genocide against Tutsi. In 1997 The Ministry was assigned an additional portfolio of managing social affairs to become Ministry of Gender, Family and Social Affairs (MIGEFASO) with a special focus on rehabilitation and emerging post conflict issues. In 1999, the Ministry of Gender and Women Promotion (MIGEPROF); was set up to focus on gender equality and women’s empowerment with a special focus on mainstreaming gender in different institutions, particularly Government ministries. In 2005, the Ministry of Gender and Family Promotion was placed under the Prime Minister’s Office with the mission on gender equality, family promotion and child protection. Since 2013 the Ministry of Gender and Family Promotion was granted autonomy.",
        "UWIMANA Consolée",
        "Minister of Gender and Family Promotion",
        "Honorable UWIMANA Consolée was appointed Minister of Gender and Family Promotion on June 12, 2024.  Before this, she served in Rwanda's second Senate from 2012 to 2020.",
        "During her tenure in the Senate, Hon. Uwimana held significant positions, including Vice Chairperson of the Senatorial Standing Committee on Economic Development and Finance.",
        "She also served as the Secretary General of the Rwanda Women Parliamentary Forum (FFRP) and Vice President of the Anti-Genocide Parliamentary Forum (AGPF).",
        "In addition, she represented the African Parliamentarians Network against Corruption-Rwanda Chapter (APNAC-Rwanda) in APNAC-Africa and at the regional level and has been a committee member of the Rwanda Parliamentarians' Network on Population and Development (RPRPD).",
        "Before entering the Senate, she worked in various positions in financial institutions such as BACAR and BPR.",
        "Mrs. Mireille BATAMULIZA",
        "Permanent Secretary",
        "Mrs.BATAMULIZA was appointed Permanent Secretary on 04th November 2021. Prior to her appointment; she was the Director General for Family Promotion and Child Rights Protection since August 2020. She is a social activist with eight years of experience working with Imbuto Foundation, a local non-profit organization that contributes towards a development of a healthy, educated and prosperous society. Before pursuing her Masters' Degree in Social Work at China Women’s University, option of Women’s Leadership and Social Development, she was working as Director in Social Affairs Department at the Office of the President.",
        "Mireille has a special talent of working with vulnerable groups especially women, adolescent girls, children and those affected by socio-cultural problems. She actively participated in community and university activities mainly in the areas of women’s rights, the fight against gender-based violence, child rights protection, HIV and AIDS.",
        "Mrs. Mireille BATAMULIZA has expertise in project management and monitoring evaluation as she experienced this in various domains including health, education and social development. She has nursing background and holds Bachelor’s Degree in Social Sciences. Mireille is innovative and has strong team work abilities.",
        "Mr. Patrick UFASHINGABO",
        "Advisor to the Minister",
        "Mr. UFASHINGABO is the Advisor to Hon. Minister since July 2020. He holds a Master’s degree in Gender and Development and a Bachelor’s degree in Education majoring in Biology; both from the University of Rwanda. Before joining the Ministry, he worked for 6 years with different local and international NGOs. He also worked in the education field prior to joining nonprofit sector.",
        "His contribution as a lead or secondary consultant range from Gender, Human rights, Justice and Project management. He is passionate about the advancement of gender equality, positive masculinity and women’s empowerment.",
        "Mr. Silas NGAYABOSHYA",
        "Director General for Gender Promotion and Women Empowerment Directorate",
        "Mr. Silas NGAYABOSHYA currently serves as the Director General of Gender Promotion and Women Empowerment effective June 2021.For the last 16 years, Silas has accumulated vast and strong professional record in projects cycle management around Human Rights, Gender equality promotion and women empowerment, child protection, inclusive education & development, with both national and international non-governmental organizations. His main areas of his experience include, project life cycle management, analyst in Gender Equality promotion and engaging men as allies and positive partners for women empowerment, GBV prevention and Mainstreaming MenEngage approaches into gender transformative programs. He has been also Involved in different projects assessments & evaluation with different organizations.",
        "Silas NGAYABOSHYA has been commissioned to facilitate different capacity building sessions on Gender equality promotion, MenEngage and Gender Transformative Approaches (GTA) for different staff and beneficiaries with national and international NGOs/Development partners, in Rwanda and abroad (Madagascar, Burkina Faso and Ghana). Having occupied senior management positions, Silas has also a vast experience in donor stewardship and fundraising, program strategic leadership, program financial management and quality reporting, as well as human resource management, capacity building and compliance.",
        "Silas holds a master’s degree of Social Sciences in Gender and Development from University of Rwanda, a bachelors degree of Social Sciences with education and a continuous professional diploma in special needs and inclusive education.",
        "Mrs Aline Umutoni",
        "Director General of Family Promotion and Child Protection",
        "Mrs Aline Umutoni is currently serving in the Ministry of Gender and Family Promotion as the Director General of Family Promotion and Child Protection.",
        "She is a Gender equality advocate, strongly believing that the family constitute the foundation of the Rwandan society.",
        "She is experienced in Project management and has been involved in projects operating in the areas of employment promotion, stakeholders' engagement, women’s economic empowerment, street children's reintegration into their families and career guidance for youth.",
        "She has worked with Local and International NGOs, Public Institution and the Private Sector.",
        "She has successfully worked in capacity development for Youth, adults  and women in particular and ensured effective knowledge transfer towards a socio-economic positive change.",
        "She is a Social Worker by profession, she is a people’s person and passionate about people’ personal and professional wellbeing and development.",
        "She holds a Master’s degree in Gender and Development, a Post graduate certificate in Professional Counselling and a Bachelor’s Degree in Social work.",
        "Connect with us",
        "9059 (toll free)",
        "info@migeprof.gov.rw",
        "Contact Us →",
        "Check Mail |MIGEPROF Staff",
        "© 2024 Government of the Republic of Rwanda"
    ]
}